app/Models/ModelBarangMasuk.php

INSERT INTO `barang_masuk` (`no_faktur`, `id_supplier`, `id_produk`, `tgl_masuk`, `jml_barang`, `id_pegawai`, `harga_beli`) VALUES (47294, '1', 'PRO-01', '2023-06-23', '10', '1', '4000')
---
    public function addDataBarangMasuk($data)
    {
        $query = $this->db->table('barang_masuk')
            ->insert($data);