app/Models/ModelProduk.php

INSERT INTO `produk` (`id_produk`, `nm_produk`, `id_supplier`, `deskripsi`, `stok`, `id_satuan`, `id_kategori`, `harga_beli`, `harga_jual`) VALUES ('PRO-01', 'eonomi', '1', 'adhaosdodh', '10', '1', '1', '4000', '5000')
---
    public function addProduk($data)
    {
        $query = $this->db->table('produk')
            ->insert($data);